tutorials/reactingFoam/counterFlowFlame2D_GRI_balanced/Allrun
./Allclean
blockMesh > log.blockMesh
decomposePar > log.decompose
N_PROCS=$(find processor* -maxdepth 0 -type d | wc -l)
mpirun -np $N_PROCS reactingFoam -parallel > log.reactingFoam
